# Тексты внутриб ота
# ⤵



welcome_txt = 'Добро пожаловать. Выберите тип аккаунта ⤵'

restart_txt = 'Вы вернулись в главное меню'

start_admin = 'Вы успешно зарегистрировались в системе, как руководитель. Пробный период на 7 дней был активирован.\n' \
              '<a  href="https://www.artlebedev.ru/dj/">Рекомендуем Вам ознакомиться с возможностями бота. </a> '

start_employee = '<a href="https://www.artlebedev.ru/dj/">Рекомендуем Вам ознакомиться с возможностями бота. </a>'

start_employee_no_code = 'Добро пожаловать, вы зарегистрировались без подключения к компании.' \
                         '\nУточните код компании или передайте свой, старшему руководителю.\n' \
                         '<a href="https://www.artlebedev.ru/dj/">Рекомендуем Вам ознакомиться с возможностями бота. </a>'


template_state = '<u>Текущие настройки проекта</u>\n\n<i>{}</i>\n\n' \
                 '<b>Время отправки:</b>\n<i>{}</i>\n\nДни отправки: <i>{}</i>\n\nВремя для ответа : <i>{}</i>'